/** ============================================================
 ** workflow.c
 ------------------------------------------------------------
 ** Role .......... : Gestion du Workflow
 ** Auteur ........ : Loïc Lété sur une idée de Michel Louvet
 ** Mise à jour ... : 31/12/2017
 ===============================================================
 ** Note du Fichier :
 ---------------------------------------------------------------


 =============================================================== **/

// ----------------------
// * Fichier d'include
// ---------------------
#include "header/main.h"

// ---------------------------
// * Déclaration des variables
// ---------------------------
unsigned char scene;

// ----------------------------------
// * scene_set()
//     Chargement du nom de la scène
// ----------------------------------

void scene_set(unsigned char value)
{
    scene=value;
}

// ------------------------------------
// * scene_get()
//     Récupération du nom de la scène
// ------------------------------------
int scene_get()
{
    return scene;
}
